Revit 2027 API
UV.Multiply Method
Multiplies this 2-D vector by the specified value and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Multiply(
	double value
)
Public Function Multiply (
	value As Double
) As UV
public:
UV^ Multiply(
	double value
)
member Multiply :
        value : float -> UV
Parameters
value Double
The value to multiply with this vector.
Return Value
UV
The multiplied 2-D vector.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the specified value is an infinite number.
Remarks
 The multiplied vector is obtained by multiplying each coordinate of this vector by the specified value.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace